<?php

include_once '../../lib/lib_common.php';

$s = 'Аммиак р-р  (для выведения  из обморочного состояния)
Жгут кровоостанавливающий
Панкреатин (ферменты пищеварительные)
Лоперамид (симптоматическое лечение острой и хронической диареии)
Бинт стерильный 7м х 14см
Нитроглицерин (применяют для устранения стенокардических приступов)
Корвалол, капли (бессонница и неврозы с высокой раздражительностью)
Валидол (Спазм гладкой мускулатуры внутренних органов)
Дротаверин (средство, снимающее спазм)
Ацетилсалициловая кислота (жаропонижающее средство)
Ибупрофен (противовоспалительное, обезболивающее,  жаропонижающее средство)
Парацетамол (противовоспалительное и жаропонижающее средство)
Пластырь бактерицидный
Пластырь текстиль, эластик
Спиртовой раствор бриллиантового зеленого (антисептическое средство наружного применения)
Спиртовая настойка йода (антисептическое средство наружного применения)
Градусник ( Электронный -цифровые- термометр  более безопасен, чем  ртутный)
Ушные капли (капли, содержащие обезболивающий и антибактериальный компоненты)
Ватные ушные палочки (средство личной гигиены)
Глазные капли (на основе сульфацил натрия и/или тетризолина гидрохлорида)
Гигиенические салфетки/ Антисептический гель или салфетки (средство личной гигиены)
3% раствор перекиси водорода
Йогулакт (БАД к пище,источник пробиотических микроорганизмов.)
Депантол (комбинированный препарат, улучшающий трофику и регенерацию тканей, с противомикробной активностью для наружного применения)
Д-Пантенол ( улучшающает трофику и регенерацию тканей для наружного применения)
СНУП (средство от насморка содержащие ксилометазолин и морскую воду )
Аквалор (при насморке, средство для промывания носа  на основе морской воды)
Аквалор горло (средство для горла на основе морской воды)
Омнитус, сироп (средство от сухого кашля)
Камистад, гель (средство для снятия боли при воспалении слизистой оболочки рта и губ)
Фореталь, 10% мочевины, крем (средство по уходу за кожей рук и сухими участками тел)
Антраль Микросеребро, крем (средство для ухода за чувствительной кожей лица и тела)
Вайтсорб (при пищевых и алкогольных отравлениях, источник кремния)
Парацетамол (противовоспалительное и жаропонижающее средство)
Ацетилсалициловая кислота (жаропонижающее средство)
Ибупрофен (противовоспалительное, обезболивающее,  жаропонижающее средство)
Глазные капли (на основе сульфацил натрия и/или тетризолина гидрохлорида)
Ушные капли (капли, содержащие обезболивающий и антибактериальный компоненты)
Панкреатин (пищеварительные ферменты)
Лоперамид (симптоматическое лечение острой и хронической диареии)
Дротаверин (средство, снимающее спазм)
Лоратадин (противоаллергическое средство)
Корвалол, капли (бессонница и неврозы с высокой раздражительностью)
Нашатырный спирт
Ватные ушные палочки (средство личной гигиены)
Пластырь бактерицидный
Спиртовой раствор бриллиантового зеленого (антисептическое средство наружного применения)
Спиртовая настойка йода (антисептическое средство наружного применения)
Гигиенические салфетки/ Антисептический гель или салфетки (средство личной гигиены)
Градусник ( Электронный -цифровые- термометр  более безопасен, чем  ртутный)
Беруши (средство защиты ушей от шума)
Йогулакт (БАД к пище,источник пробиотических микроорганизмов.)
Депантол (комбинированный препарат, улучшающий трофику и регенерацию тканей, с противомикробной активностью для наружного применения)
Д-Пантенол ( улучшающает трофику и регенерацию тканей для наружного применения)
СНУП (средство от насморка содержащие ксилометазолин и морскую воду )
Аквалор (при насморке, средство для промывания носа  на основе морской воды)
Аквалор горло (средство для горла на основе морской воды)
Омнитус, сироп (средство от сухого кашля)
Камистад, гель (средство для снятия боли при воспалении слизистой оболочки рта и губ)
Фореталь, 10% мочевины, крем (средство по уходу за кожей рук и сухими участками тел)
Антраль Микросеребро, крем (средство для ухода за чувствительной кожей лица и тела)
Вайтсорб (при пищевых и алкогольных отравлениях, источник кремния)
Омнитус, таблетки (средство от сухого кашля)
Гепатромбин С (средство при гематомах, воспалении мышц, сухожилий,  связок после ушибов, сдавлений, травм)
Ибупрофен (противовоспалительное и жаропонижающее средство)
Парацетамол (противовоспалительное и жаропонижающее средство)
Кетоларака-трометамин (онестероидный препарат с сильно выраженным обезболивающим эффектом.)
Глазные капли (на основе сульфацил натрия и/или тетризолина гидрохлорида)
Ушные капли (капли, содержащие обезболивающий и антибактериальный компоненты)
Панкреатин (пищеварительные ферменты)
Лоперамид (средство от диареи)
Дротаверин (средство, снимающее спазм)
Метоклопрамид (противорвотное средство)
Дименгидринат (средство от укачивания)
Лоратадин (антигистаминное средство)
Валокордин (комбинированное лекарственное средство, обладающее седативным эффектом)
Нашатырный спирт
Ушные палочки
Пластырь бактерицидный
Спиртовой раствор бриллиантового зеленого (антисептическое средство наружного применения)
Спиртовая настойка йода (антисептическое средство наружного применения)
Гигиенические салфетки/ Антисептический гель или салфетки (средство личной гигиены)
Градусник ( Электронный -цифровые- термометр  более безопасен, чем  ртутный)
Беруши (средство защиты ушей от шума)
Йогулакт (БАД к пище,источник пробиотических микроорганизмов.)
Депантол (комбинированный препарат, улучшающий трофику и регенерацию тканей, с противомикробной активностью для наружного применения)
СНУП (средство от насморка содержащие ксилометазолин и морскую воду )
Аквалор (при насморке, средство для промывания носа  на основе морской воды)
Аквалор горло (средство для горла на основе морской воды)
Омнитус, сироп (средство от сухого кашля)
Омнитус, таблетки (средство от сухого кашля)
Антраль Микросеребро, крем (средство для ухода за чувствительной кожей лица и тела)
Вайтсорб (при пищевых и алкогольных отравлениях, источник кремния)
Лейкопластырь
Бинт стерильный 7м х 14см
Бинт эластичный (средство от растяжения)
Гигиенические салфетки/ Антисептический гель или салфетки (средство личной гигиены)
Охлаждающий пакет (средство от ушибов и травм)
Ножницы тупоконечные, средний размер
Булавка безопасная 
Перчатки пара
Разогревающий гель на основе красного перца и др. раздражающих компонентов
Депантол (комбинированный препарат, улучшающий трофику и регенерацию тканей, с противомикробной активностью для наружного применения)
Гепатромбин С (средство от травм, синяков)
Ацетисалициловая кислота (жаропонижающее средство)
Парацетамол (противовоспалительное и жаропонижающее средство)
Ибупрофен (противовоспалительное и жаропонижающее средство)
Ушные капли (капли, содержащие обезболивающий и антибактериальный компоненты)
Глазные капли (на основе сульфацил натрия и/или тетризолина гидрохлорида)
Средство от боли в горле (с противовоспалительным и обезболивающим действием)
Гигиенические салфетки/ Антисептический гель или салфетки (средство личной гигиены)
Градусник ( Электронный -цифровые- термометр  более безопасен, чем  ртутный)
Панкреатин (ферменты пищеварительные)
Лоперамид (симптоматическое лечение острой и хронической диареии)
Дротаверин (средство,снимающее спазмы)
Лоратадин (антигистаминное средство)
Валокордин
Нашатырный спирт (раствор аммиака)
Ватные ушные палочки (средство личной гигиены)
Пластырь бактерицидный
Спиртовой раствор бриллиантового зеленого (антисептическое средство наружного применения)
Спиртовая настойка йода (антисептическое средство наружного применения)
СНУП (средство от насморка содержащие ксилометазолин и морскую воду )
Аквалор (при насморке, средство для промывания носа  на основе морской воды)
Аквалор горло (средство для горла на основе морской воды)
Омнитус, сироп (средство от сухого кашля)
Омнитус, таблетки (средство от сухого кашля)
Вайтсорб (при пищевых и алкогольных отравлениях, источник кремния)';

$list = explode("\n", $s);

$drugs = array();
$map = array();

$id = 1;

foreach ($list as $i => $string)
{
    $title = parseTitle($string);

    if (empty($map[$title[0]]))
    {
        $map[$title[0]] = $id;

        $drugs[$id] = array(
            'id' => $id,
            'title' => $title[0],
            'description' => $title[1],
            'price' => rand(250, 950),
            'images' => ['../_temp/products/1.png']
        );

        $id++;
    } else if (!empty($drugs[$id]) && empty($drugs[$id]['description']) && !empty($title[1])) {
        $drugs[$id]['description'] = $title[1];
    }
}

function parseTitle($title)
{
    $title = trim($title);
    preg_match('#^([^\(]+)(\([^\)]+\))?$#isxu', $title, $m);

    if (empty($m[2])) $m[2] = '';

    $m[2] = trim($m[2]);
    $m[2] = trim($m[2], ')');
    $m[2] = trim($m[2], '(');

    return array(trim($m[1]), $m[2]);
}

var_export(array_values($drugs));

