<?php

return array (
    1 => array (
        'id' => 1,
        'title' => 'Анальгетики',
    ),
    2 => array (
        'id' => 2,
        'title' => 'Анальгетики-антипиретики',
    ),
    3 => array (
        'id' => 3,
        'title' => 'Витамины',
    ),
    4 => array (
        'id' => 4,
        'title' => 'Детская косметика',
    ),
    5 => array (
        'id' => 5,
        'title' => 'Желудочно-кишечный тракт',
    ),
    6 => array (
        'id' => 6,
        'title' => 'Защита от солнца',
    ),
    7 => array (
        'id' => 7,
        'title' => 'Иммуностимулирующее средство',
    ),
    8 => array (
        'id' => 8,
        'title' => 'Инфекционные заболевания',
    ),
    9 => array (
        'id' => 9,
        'title' => 'Кардиология',
    ),
    10 => array (
        'id' => 10,
        'title' => 'Наружное применение',
    ),
    11 => array (
        'id' => 11,
        'title' => 'Нестероидный противовоспалительный препарат',
    ),
    12 => array (
        'id' => 12,
        'title' => 'Офтальмология',
    ),
    13 => array (
        'id' => 13,
        'title' => 'Противовирусное средство',
    ),
    14 => array (
        'id' => 14,
        'title' => 'Симптоматические препараты',
    ),
    15 => array (
        'id' => 15,
        'title' => 'Урология',
    ),
);










